Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
/*
 * Component description for AIC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_AIC_COMPONENT_H_
#define _SAMA5D_AIC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR AIC                                          */
/* ************************************************************************** */

/* -------- AIC_SSR : (AIC Offset: 0x00) (R/W 32) Source Select Register -------- */
#define AIC_SSR_INTSEL_Pos                    _UINT32_(0)                                          /* (AIC_SSR) Interrupt Line Selection Position */
#define AIC_SSR_INTSEL_Msk                    (_UINT32_(0x7F) << AIC_SSR_INTSEL_Pos)               /* (AIC_SSR) Interrupt Line Selection Mask */
#define AIC_SSR_INTSEL(value)                 (AIC_SSR_INTSEL_Msk & (_UINT32_(value) << AIC_SSR_INTSEL_Pos)) /* Assigment of value for INTSEL in the AIC_SSR register */
#define AIC_SSR_Msk                           _UINT32_(0x0000007F)                                 /* (AIC_SSR) Register Mask  */


/* -------- AIC_SMR : (AIC Offset: 0x04) (R/W 32) Source Mode Register -------- */
#define AIC_SMR_PRIORITY_Pos                  _UINT32_(0)                                          /* (AIC_SMR) Priority Level Position */
#define AIC_SMR_PRIORITY_Msk                  (_UINT32_(0x7) << AIC_SMR_PRIORITY_Pos)              /* (AIC_SMR) Priority Level Mask */
#define AIC_SMR_PRIORITY(value)               (AIC_SMR_PRIORITY_Msk & (_UINT32_(value) << AIC_SMR_PRIORITY_Pos)) /* Assigment of value for PRIORITY in the AIC_SMR register */
#define   AIC_SMR_PRIORITY_MINIMUM_Val        _UINT32_(0x0)                                        /* (AIC_SMR) Minimum priority  */
#define   AIC_SMR_PRIORITY_VERY_LOW_Val       _UINT32_(0x1)                                        /* (AIC_SMR) Very low priority  */
#define   AIC_SMR_PRIORITY_LOW_Val            _UINT32_(0x2)                                        /* (AIC_SMR) Low priority  */
#define   AIC_SMR_PRIORITY_MEDIUM_LOW_Val     _UINT32_(0x3)                                        /* (AIC_SMR) Medium priority  */
#define   AIC_SMR_PRIORITY_MEDIUM_HIGH_Val    _UINT32_(0x4)                                        /* (AIC_SMR) Medium-high priority  */
#define   AIC_SMR_PRIORITY_HIGH_Val           _UINT32_(0x5)                                        /* (AIC_SMR) High priority  */
#define   AIC_SMR_PRIORITY_VERY_HIGH_Val      _UINT32_(0x6)                                        /* (AIC_SMR) Very high priority  */
#define   AIC_SMR_PRIORITY_MAXIMUM_Val        _UINT32_(0x7)                                        /* (AIC_SMR) Maximum priority  */
#define AIC_SMR_PRIORITY_MINIMUM              (AIC_SMR_PRIORITY_MINIMUM_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Minimum priority Position  */
#define AIC_SMR_PRIORITY_VERY_LOW             (AIC_SMR_PRIORITY_VERY_LOW_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Very low priority Position  */
#define AIC_SMR_PRIORITY_LOW                  (AIC_SMR_PRIORITY_LOW_Val << AIC_SMR_PRIORITY_Pos)   /* (AIC_SMR) Low priority Position  */
#define AIC_SMR_PRIORITY_MEDIUM_LOW           (AIC_SMR_PRIORITY_MEDIUM_LOW_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Medium priority Position  */
#define AIC_SMR_PRIORITY_MEDIUM_HIGH          (AIC_SMR_PRIORITY_MEDIUM_HIGH_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Medium-high priority Position  */
#define AIC_SMR_PRIORITY_HIGH                 (AIC_SMR_PRIORITY_HIGH_Val << AIC_SMR_PRIORITY_Pos)  /* (AIC_SMR) High priority Position  */
#define AIC_SMR_PRIORITY_VERY_HIGH            (AIC_SMR_PRIORITY_VERY_HIGH_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Very high priority Position  */
#define AIC_SMR_PRIORITY_MAXIMUM              (AIC_SMR_PRIORITY_MAXIMUM_Val << AIC_SMR_PRIORITY_Pos) /* (AIC_SMR) Maximum priority Position  */
#define AIC_SMR_SRCTYPE_Pos                   _UINT32_(5)                                          /* (AIC_SMR) Interrupt Source Type Position */
#define AIC_SMR_SRCTYPE_Msk                   (_UINT32_(0x3) << AIC_SMR_SRCTYPE_Pos)               /* (AIC_SMR) Interrupt Source Type Mask */
#define AIC_SMR_SRCTYPE(value)                (AIC_SMR_SRCTYPE_Msk & (_UINT32_(value) << AIC_SMR_SRCTYPE_Pos)) /* Assigment of value for SRCTYPE in the AIC_SMR register */
#define   AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val _UINT32_(0x0)                                        /* (AIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source  */
#define   AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val _UINT32_(0x1)                                        /* (AIC_SMR) Negative-edge triggered for external source  */
#define   AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val  _UINT32_(0x2)                                        /* (AIC_SMR) High-level sensitive for internal source. High-level sensitive for external source  */
#define   AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val _UINT32_(0x3)                                        /* (AIC_SMR) Positive-edge triggered for external source  */
#define AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE   (AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val << AIC_SMR_SRCTYPE_Pos) /* (AIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE     (AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val << AIC_SMR_SRCTYPE_Pos) /* (AIC_SMR) Negative-edge triggered for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL        (AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val << AIC_SMR_SRCTYPE_Pos) /* (AIC_SMR) High-level sensitive for internal source. High-level sensitive for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE     (AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val << AIC_SMR_SRCTYPE_Pos) /* (AIC_SMR) Positive-edge triggered for external source Position  */
#define AIC_SMR_Msk                           _UINT32_(0x00000067)                                 /* (AIC_SMR) Register Mask  */


/* -------- AIC_SVR : (AIC Offset: 0x08) (R/W 32) Source Vector Register -------- */
#define AIC_SVR_VECTOR_Pos                    _UINT32_(0)                                          /* (AIC_SVR) Source Vector Position */
#define AIC_SVR_VECTOR_Msk                    (_UINT32_(0xFFFFFFFF) << AIC_SVR_VECTOR_Pos)         /* (AIC_SVR) Source Vector Mask */
#define AIC_SVR_VECTOR(value)                 (AIC_SVR_VECTOR_Msk & (_UINT32_(value) << AIC_SVR_VECTOR_Pos)) /* Assigment of value for VECTOR in the AIC_SVR register */
#define AIC_SVR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AIC_SVR) Register Mask  */


/* -------- AIC_IVR : (AIC Offset: 0x10) ( R/ 32) Interrupt Vector Register -------- */
#define AIC_IVR_IRQV_Pos                      _UINT32_(0)                                          /* (AIC_IVR) Interrupt Vector Register Position */
#define AIC_IVR_IRQV_Msk                      (_UINT32_(0xFFFFFFFF) << AIC_IVR_IRQV_Pos)           /* (AIC_IVR) Interrupt Vector Register Mask */
#define AIC_IVR_IRQV(value)                   (AIC_IVR_IRQV_Msk & (_UINT32_(value) << AIC_IVR_IRQV_Pos)) /* Assigment of value for IRQV in the AIC_IVR register */
#define AIC_IVR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AIC_IVR) Register Mask  */


/* -------- AIC_FVR : (AIC Offset: 0x14) ( R/ 32) FIQ Vector Register -------- */
#define AIC_FVR_FIQV_Pos                      _UINT32_(0)                                          /* (AIC_FVR) FIQ Vector Register Position */
#define AIC_FVR_FIQV_Msk                      (_UINT32_(0xFFFFFFFF) << AIC_FVR_FIQV_Pos)           /* (AIC_FVR) FIQ Vector Register Mask */
#define AIC_FVR_FIQV(value)                   (AIC_FVR_FIQV_Msk & (_UINT32_(value) << AIC_FVR_FIQV_Pos)) /* Assigment of value for FIQV in the AIC_FVR register */
#define AIC_FVR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AIC_FVR) Register Mask  */


/* -------- AIC_ISR : (AIC Offset: 0x18) ( R/ 32) Interrupt Status Register -------- */
#define AIC_ISR_IRQID_Pos                     _UINT32_(0)                                          /* (AIC_ISR) Current Interrupt Identifier Position */
#define AIC_ISR_IRQID_Msk                     (_UINT32_(0x7F) << AIC_ISR_IRQID_Pos)                /* (AIC_ISR) Current Interrupt Identifier Mask */
#define AIC_ISR_IRQID(value)                  (AIC_ISR_IRQID_Msk & (_UINT32_(value) << AIC_ISR_IRQID_Pos)) /* Assigment of value for IRQID in the AIC_ISR register */
#define AIC_ISR_Msk                           _UINT32_(0x0000007F)                                 /* (AIC_ISR) Register Mask  */


