Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
/* -------- AIC_IPR0 : (AIC Offset: 0x20) ( R/ 32) Interrupt Pending Register 0 -------- */
#define AIC_IPR0_FIQ_Pos                      _UINT32_(0)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_FIQ_Msk                      (_UINT32_(0x1) << AIC_IPR0_FIQ_Pos)                  /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_FIQ(value)                   (AIC_IPR0_FIQ_Msk & (_UINT32_(value) << AIC_IPR0_FIQ_Pos)) /* Assigment of value for FIQ in the AIC_IPR0 register */
#define AIC_IPR0_PID1_Pos                     _UINT32_(1)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID1_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID1_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID1(value)                  (AIC_IPR0_PID1_Msk & (_UINT32_(value) << AIC_IPR0_PID1_Pos)) /* Assigment of value for PID1 in the AIC_IPR0 register */
#define AIC_IPR0_PID2_Pos                     _UINT32_(2)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID2_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID2_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID2(value)                  (AIC_IPR0_PID2_Msk & (_UINT32_(value) << AIC_IPR0_PID2_Pos)) /* Assigment of value for PID2 in the AIC_IPR0 register */
#define AIC_IPR0_PID3_Pos                     _UINT32_(3)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID3_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID3_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID3(value)                  (AIC_IPR0_PID3_Msk & (_UINT32_(value) << AIC_IPR0_PID3_Pos)) /* Assigment of value for PID3 in the AIC_IPR0 register */
#define AIC_IPR0_PID4_Pos                     _UINT32_(4)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID4_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID4_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID4(value)                  (AIC_IPR0_PID4_Msk & (_UINT32_(value) << AIC_IPR0_PID4_Pos)) /* Assigment of value for PID4 in the AIC_IPR0 register */
#define AIC_IPR0_PID5_Pos                     _UINT32_(5)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID5_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID5_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID5(value)                  (AIC_IPR0_PID5_Msk & (_UINT32_(value) << AIC_IPR0_PID5_Pos)) /* Assigment of value for PID5 in the AIC_IPR0 register */
#define AIC_IPR0_PID6_Pos                     _UINT32_(6)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID6_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID6_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID6(value)                  (AIC_IPR0_PID6_Msk & (_UINT32_(value) << AIC_IPR0_PID6_Pos)) /* Assigment of value for PID6 in the AIC_IPR0 register */
#define AIC_IPR0_PID7_Pos                     _UINT32_(7)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID7_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID7_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID7(value)                  (AIC_IPR0_PID7_Msk & (_UINT32_(value) << AIC_IPR0_PID7_Pos)) /* Assigment of value for PID7 in the AIC_IPR0 register */
#define AIC_IPR0_PID8_Pos                     _UINT32_(8)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID8_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID8_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID8(value)                  (AIC_IPR0_PID8_Msk & (_UINT32_(value) << AIC_IPR0_PID8_Pos)) /* Assigment of value for PID8 in the AIC_IPR0 register */
#define AIC_IPR0_PID9_Pos                     _UINT32_(9)                                          /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID9_Msk                     (_UINT32_(0x1) << AIC_IPR0_PID9_Pos)                 /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID9(value)                  (AIC_IPR0_PID9_Msk & (_UINT32_(value) << AIC_IPR0_PID9_Pos)) /* Assigment of value for PID9 in the AIC_IPR0 register */
#define AIC_IPR0_PID10_Pos                    _UINT32_(10)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID10_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID10_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID10(value)                 (AIC_IPR0_PID10_Msk & (_UINT32_(value) << AIC_IPR0_PID10_Pos)) /* Assigment of value for PID10 in the AIC_IPR0 register */
#define AIC_IPR0_PID11_Pos                    _UINT32_(11)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID11_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID11_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID11(value)                 (AIC_IPR0_PID11_Msk & (_UINT32_(value) << AIC_IPR0_PID11_Pos)) /* Assigment of value for PID11 in the AIC_IPR0 register */
#define AIC_IPR0_PID12_Pos                    _UINT32_(12)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID12_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID12_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID12(value)                 (AIC_IPR0_PID12_Msk & (_UINT32_(value) << AIC_IPR0_PID12_Pos)) /* Assigment of value for PID12 in the AIC_IPR0 register */
#define AIC_IPR0_PID13_Pos                    _UINT32_(13)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID13_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID13_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID13(value)                 (AIC_IPR0_PID13_Msk & (_UINT32_(value) << AIC_IPR0_PID13_Pos)) /* Assigment of value for PID13 in the AIC_IPR0 register */
#define AIC_IPR0_PID14_Pos                    _UINT32_(14)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID14_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID14_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID14(value)                 (AIC_IPR0_PID14_Msk & (_UINT32_(value) << AIC_IPR0_PID14_Pos)) /* Assigment of value for PID14 in the AIC_IPR0 register */
#define AIC_IPR0_PID15_Pos                    _UINT32_(15)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID15_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID15_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID15(value)                 (AIC_IPR0_PID15_Msk & (_UINT32_(value) << AIC_IPR0_PID15_Pos)) /* Assigment of value for PID15 in the AIC_IPR0 register */
#define AIC_IPR0_PID16_Pos                    _UINT32_(16)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID16_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID16_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID16(value)                 (AIC_IPR0_PID16_Msk & (_UINT32_(value) << AIC_IPR0_PID16_Pos)) /* Assigment of value for PID16 in the AIC_IPR0 register */
#define AIC_IPR0_PID17_Pos                    _UINT32_(17)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID17_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID17_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID17(value)                 (AIC_IPR0_PID17_Msk & (_UINT32_(value) << AIC_IPR0_PID17_Pos)) /* Assigment of value for PID17 in the AIC_IPR0 register */
#define AIC_IPR0_PID18_Pos                    _UINT32_(18)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID18_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID18_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID18(value)                 (AIC_IPR0_PID18_Msk & (_UINT32_(value) << AIC_IPR0_PID18_Pos)) /* Assigment of value for PID18 in the AIC_IPR0 register */
#define AIC_IPR0_PID19_Pos                    _UINT32_(19)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID19_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID19_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID19(value)                 (AIC_IPR0_PID19_Msk & (_UINT32_(value) << AIC_IPR0_PID19_Pos)) /* Assigment of value for PID19 in the AIC_IPR0 register */
#define AIC_IPR0_PID20_Pos                    _UINT32_(20)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID20_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID20_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID20(value)                 (AIC_IPR0_PID20_Msk & (_UINT32_(value) << AIC_IPR0_PID20_Pos)) /* Assigment of value for PID20 in the AIC_IPR0 register */
#define AIC_IPR0_PID21_Pos                    _UINT32_(21)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID21_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID21_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID21(value)                 (AIC_IPR0_PID21_Msk & (_UINT32_(value) << AIC_IPR0_PID21_Pos)) /* Assigment of value for PID21 in the AIC_IPR0 register */
#define AIC_IPR0_PID22_Pos                    _UINT32_(22)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID22_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID22_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID22(value)                 (AIC_IPR0_PID22_Msk & (_UINT32_(value) << AIC_IPR0_PID22_Pos)) /* Assigment of value for PID22 in the AIC_IPR0 register */
#define AIC_IPR0_PID23_Pos                    _UINT32_(23)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID23_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID23_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID23(value)                 (AIC_IPR0_PID23_Msk & (_UINT32_(value) << AIC_IPR0_PID23_Pos)) /* Assigment of value for PID23 in the AIC_IPR0 register */
#define AIC_IPR0_PID24_Pos                    _UINT32_(24)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID24_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID24_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID24(value)                 (AIC_IPR0_PID24_Msk & (_UINT32_(value) << AIC_IPR0_PID24_Pos)) /* Assigment of value for PID24 in the AIC_IPR0 register */
#define AIC_IPR0_PID25_Pos                    _UINT32_(25)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID25_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID25_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID25(value)                 (AIC_IPR0_PID25_Msk & (_UINT32_(value) << AIC_IPR0_PID25_Pos)) /* Assigment of value for PID25 in the AIC_IPR0 register */
#define AIC_IPR0_PID26_Pos                    _UINT32_(26)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID26_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID26_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID26(value)                 (AIC_IPR0_PID26_Msk & (_UINT32_(value) << AIC_IPR0_PID26_Pos)) /* Assigment of value for PID26 in the AIC_IPR0 register */
#define AIC_IPR0_PID27_Pos                    _UINT32_(27)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID27_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID27_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID27(value)                 (AIC_IPR0_PID27_Msk & (_UINT32_(value) << AIC_IPR0_PID27_Pos)) /* Assigment of value for PID27 in the AIC_IPR0 register */
#define AIC_IPR0_PID28_Pos                    _UINT32_(28)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID28_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID28_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID28(value)                 (AIC_IPR0_PID28_Msk & (_UINT32_(value) << AIC_IPR0_PID28_Pos)) /* Assigment of value for PID28 in the AIC_IPR0 register */
#define AIC_IPR0_PID29_Pos                    _UINT32_(29)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID29_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID29_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID29(value)                 (AIC_IPR0_PID29_Msk & (_UINT32_(value) << AIC_IPR0_PID29_Pos)) /* Assigment of value for PID29 in the AIC_IPR0 register */
#define AIC_IPR0_PID30_Pos                    _UINT32_(30)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID30_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID30_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID30(value)                 (AIC_IPR0_PID30_Msk & (_UINT32_(value) << AIC_IPR0_PID30_Pos)) /* Assigment of value for PID30 in the AIC_IPR0 register */
#define AIC_IPR0_PID31_Pos                    _UINT32_(31)                                         /* (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID31_Msk                    (_UINT32_(0x1) << AIC_IPR0_PID31_Pos)                /* (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID31(value)                 (AIC_IPR0_PID31_Msk & (_UINT32_(value) << AIC_IPR0_PID31_Pos)) /* Assigment of value for PID31 in the AIC_IPR0 register */
#define AIC_IPR0_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AIC_IPR0) Register Mask  */

