Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
#define AIC_IPR0_PID_Pos                      _UINT32_(1)                                          /* (AIC_IPR0 Position) Interrupt Pending */
#define AIC_IPR0_PID_Msk                      (_UINT32_(0x7FFFFFFF) << AIC_IPR0_PID_Pos)           /* (AIC_IPR0 Mask) PID */
#define AIC_IPR0_PID(value)                   (AIC_IPR0_PID_Msk & (_UINT32_(value) << AIC_IPR0_PID_Pos)) 

/* -------- AIC_IPR1 : (AIC Offset: 0x24) ( R/ 32) Interrupt Pending Register 1 -------- */
#define AIC_IPR1_PID32_Pos                    _UINT32_(0)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID32_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID32_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID32(value)                 (AIC_IPR1_PID32_Msk & (_UINT32_(value) << AIC_IPR1_PID32_Pos)) /* Assigment of value for PID32 in the AIC_IPR1 register */
#define AIC_IPR1_PID33_Pos                    _UINT32_(1)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID33_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID33_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID33(value)                 (AIC_IPR1_PID33_Msk & (_UINT32_(value) << AIC_IPR1_PID33_Pos)) /* Assigment of value for PID33 in the AIC_IPR1 register */
#define AIC_IPR1_PID34_Pos                    _UINT32_(2)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID34_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID34_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID34(value)                 (AIC_IPR1_PID34_Msk & (_UINT32_(value) << AIC_IPR1_PID34_Pos)) /* Assigment of value for PID34 in the AIC_IPR1 register */
#define AIC_IPR1_PID35_Pos                    _UINT32_(3)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID35_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID35_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID35(value)                 (AIC_IPR1_PID35_Msk & (_UINT32_(value) << AIC_IPR1_PID35_Pos)) /* Assigment of value for PID35 in the AIC_IPR1 register */
#define AIC_IPR1_PID36_Pos                    _UINT32_(4)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID36_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID36_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID36(value)                 (AIC_IPR1_PID36_Msk & (_UINT32_(value) << AIC_IPR1_PID36_Pos)) /* Assigment of value for PID36 in the AIC_IPR1 register */
#define AIC_IPR1_PID37_Pos                    _UINT32_(5)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID37_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID37_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID37(value)                 (AIC_IPR1_PID37_Msk & (_UINT32_(value) << AIC_IPR1_PID37_Pos)) /* Assigment of value for PID37 in the AIC_IPR1 register */
#define AIC_IPR1_PID38_Pos                    _UINT32_(6)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID38_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID38_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID38(value)                 (AIC_IPR1_PID38_Msk & (_UINT32_(value) << AIC_IPR1_PID38_Pos)) /* Assigment of value for PID38 in the AIC_IPR1 register */
#define AIC_IPR1_PID39_Pos                    _UINT32_(7)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID39_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID39_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID39(value)                 (AIC_IPR1_PID39_Msk & (_UINT32_(value) << AIC_IPR1_PID39_Pos)) /* Assigment of value for PID39 in the AIC_IPR1 register */
#define AIC_IPR1_PID40_Pos                    _UINT32_(8)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID40_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID40_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID40(value)                 (AIC_IPR1_PID40_Msk & (_UINT32_(value) << AIC_IPR1_PID40_Pos)) /* Assigment of value for PID40 in the AIC_IPR1 register */
#define AIC_IPR1_PID41_Pos                    _UINT32_(9)                                          /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID41_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID41_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID41(value)                 (AIC_IPR1_PID41_Msk & (_UINT32_(value) << AIC_IPR1_PID41_Pos)) /* Assigment of value for PID41 in the AIC_IPR1 register */
#define AIC_IPR1_PID42_Pos                    _UINT32_(10)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID42_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID42_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID42(value)                 (AIC_IPR1_PID42_Msk & (_UINT32_(value) << AIC_IPR1_PID42_Pos)) /* Assigment of value for PID42 in the AIC_IPR1 register */
#define AIC_IPR1_PID43_Pos                    _UINT32_(11)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID43_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID43_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID43(value)                 (AIC_IPR1_PID43_Msk & (_UINT32_(value) << AIC_IPR1_PID43_Pos)) /* Assigment of value for PID43 in the AIC_IPR1 register */
#define AIC_IPR1_PID44_Pos                    _UINT32_(12)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID44_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID44_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID44(value)                 (AIC_IPR1_PID44_Msk & (_UINT32_(value) << AIC_IPR1_PID44_Pos)) /* Assigment of value for PID44 in the AIC_IPR1 register */
#define AIC_IPR1_PID45_Pos                    _UINT32_(13)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID45_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID45_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID45(value)                 (AIC_IPR1_PID45_Msk & (_UINT32_(value) << AIC_IPR1_PID45_Pos)) /* Assigment of value for PID45 in the AIC_IPR1 register */
#define AIC_IPR1_PID46_Pos                    _UINT32_(14)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID46_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID46_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID46(value)                 (AIC_IPR1_PID46_Msk & (_UINT32_(value) << AIC_IPR1_PID46_Pos)) /* Assigment of value for PID46 in the AIC_IPR1 register */
#define AIC_IPR1_PID47_Pos                    _UINT32_(15)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID47_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID47_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID47(value)                 (AIC_IPR1_PID47_Msk & (_UINT32_(value) << AIC_IPR1_PID47_Pos)) /* Assigment of value for PID47 in the AIC_IPR1 register */
#define AIC_IPR1_PID48_Pos                    _UINT32_(16)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID48_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID48_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID48(value)                 (AIC_IPR1_PID48_Msk & (_UINT32_(value) << AIC_IPR1_PID48_Pos)) /* Assigment of value for PID48 in the AIC_IPR1 register */
#define AIC_IPR1_PID49_Pos                    _UINT32_(17)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID49_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID49_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID49(value)                 (AIC_IPR1_PID49_Msk & (_UINT32_(value) << AIC_IPR1_PID49_Pos)) /* Assigment of value for PID49 in the AIC_IPR1 register */
#define AIC_IPR1_PID50_Pos                    _UINT32_(18)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID50_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID50_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID50(value)                 (AIC_IPR1_PID50_Msk & (_UINT32_(value) << AIC_IPR1_PID50_Pos)) /* Assigment of value for PID50 in the AIC_IPR1 register */
#define AIC_IPR1_PID51_Pos                    _UINT32_(19)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID51_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID51_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID51(value)                 (AIC_IPR1_PID51_Msk & (_UINT32_(value) << AIC_IPR1_PID51_Pos)) /* Assigment of value for PID51 in the AIC_IPR1 register */
#define AIC_IPR1_PID52_Pos                    _UINT32_(20)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID52_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID52_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID52(value)                 (AIC_IPR1_PID52_Msk & (_UINT32_(value) << AIC_IPR1_PID52_Pos)) /* Assigment of value for PID52 in the AIC_IPR1 register */
#define AIC_IPR1_PID53_Pos                    _UINT32_(21)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID53_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID53_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID53(value)                 (AIC_IPR1_PID53_Msk & (_UINT32_(value) << AIC_IPR1_PID53_Pos)) /* Assigment of value for PID53 in the AIC_IPR1 register */
#define AIC_IPR1_PID54_Pos                    _UINT32_(22)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID54_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID54_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID54(value)                 (AIC_IPR1_PID54_Msk & (_UINT32_(value) << AIC_IPR1_PID54_Pos)) /* Assigment of value for PID54 in the AIC_IPR1 register */
#define AIC_IPR1_PID55_Pos                    _UINT32_(23)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID55_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID55_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID55(value)                 (AIC_IPR1_PID55_Msk & (_UINT32_(value) << AIC_IPR1_PID55_Pos)) /* Assigment of value for PID55 in the AIC_IPR1 register */
#define AIC_IPR1_PID56_Pos                    _UINT32_(24)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID56_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID56_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID56(value)                 (AIC_IPR1_PID56_Msk & (_UINT32_(value) << AIC_IPR1_PID56_Pos)) /* Assigment of value for PID56 in the AIC_IPR1 register */
#define AIC_IPR1_PID57_Pos                    _UINT32_(25)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID57_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID57_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID57(value)                 (AIC_IPR1_PID57_Msk & (_UINT32_(value) << AIC_IPR1_PID57_Pos)) /* Assigment of value for PID57 in the AIC_IPR1 register */
#define AIC_IPR1_PID58_Pos                    _UINT32_(26)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID58_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID58_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID58(value)                 (AIC_IPR1_PID58_Msk & (_UINT32_(value) << AIC_IPR1_PID58_Pos)) /* Assigment of value for PID58 in the AIC_IPR1 register */
#define AIC_IPR1_PID59_Pos                    _UINT32_(27)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID59_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID59_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID59(value)                 (AIC_IPR1_PID59_Msk & (_UINT32_(value) << AIC_IPR1_PID59_Pos)) /* Assigment of value for PID59 in the AIC_IPR1 register */
#define AIC_IPR1_PID60_Pos                    _UINT32_(28)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID60_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID60_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID60(value)                 (AIC_IPR1_PID60_Msk & (_UINT32_(value) << AIC_IPR1_PID60_Pos)) /* Assigment of value for PID60 in the AIC_IPR1 register */
#define AIC_IPR1_PID61_Pos                    _UINT32_(29)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID61_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID61_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID61(value)                 (AIC_IPR1_PID61_Msk & (_UINT32_(value) << AIC_IPR1_PID61_Pos)) /* Assigment of value for PID61 in the AIC_IPR1 register */
#define AIC_IPR1_PID62_Pos                    _UINT32_(30)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID62_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID62_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID62(value)                 (AIC_IPR1_PID62_Msk & (_UINT32_(value) << AIC_IPR1_PID62_Pos)) /* Assigment of value for PID62 in the AIC_IPR1 register */
#define AIC_IPR1_PID63_Pos                    _UINT32_(31)                                         /* (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID63_Msk                    (_UINT32_(0x1) << AIC_IPR1_PID63_Pos)                /* (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID63(value)                 (AIC_IPR1_PID63_Msk & (_UINT32_(value) << AIC_IPR1_PID63_Pos)) /* Assigment of value for PID63 in the AIC_IPR1 register */
#define AIC_IPR1_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AIC_IPR1) Register Mask  */

#define AIC_IPR1_PID_Pos                      _UINT32_(0)                                          /* (AIC_IPR1 Position) Interrupt Pending */
#define AIC_IPR1_PID_Msk                      (_UINT32_(0xFFFFFFFF) << AIC_IPR1_PID_Pos)           /* (AIC_IPR1 Mask) PID */
#define AIC_IPR1_PID(value)                   (AIC_IPR1_PID_Msk & (_UINT32_(value) << AIC_IPR1_PID_Pos)) 

