Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
/* -------- AIC_IPR2 : (AIC Offset: 0x28) ( R/ 32) Interrupt Pending Register 2 -------- */
#define AIC_IPR2_PID64_Pos                    _UINT32_(0)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID64_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID64_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID64(value)                 (AIC_IPR2_PID64_Msk & (_UINT32_(value) << AIC_IPR2_PID64_Pos)) /* Assigment of value for PID64 in the AIC_IPR2 register */
#define AIC_IPR2_PID65_Pos                    _UINT32_(1)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID65_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID65_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID65(value)                 (AIC_IPR2_PID65_Msk & (_UINT32_(value) << AIC_IPR2_PID65_Pos)) /* Assigment of value for PID65 in the AIC_IPR2 register */
#define AIC_IPR2_PID66_Pos                    _UINT32_(2)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID66_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID66_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID66(value)                 (AIC_IPR2_PID66_Msk & (_UINT32_(value) << AIC_IPR2_PID66_Pos)) /* Assigment of value for PID66 in the AIC_IPR2 register */
#define AIC_IPR2_PID67_Pos                    _UINT32_(3)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID67_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID67_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID67(value)                 (AIC_IPR2_PID67_Msk & (_UINT32_(value) << AIC_IPR2_PID67_Pos)) /* Assigment of value for PID67 in the AIC_IPR2 register */
#define AIC_IPR2_PID68_Pos                    _UINT32_(4)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID68_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID68_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID68(value)                 (AIC_IPR2_PID68_Msk & (_UINT32_(value) << AIC_IPR2_PID68_Pos)) /* Assigment of value for PID68 in the AIC_IPR2 register */
#define AIC_IPR2_PID69_Pos                    _UINT32_(5)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID69_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID69_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID69(value)                 (AIC_IPR2_PID69_Msk & (_UINT32_(value) << AIC_IPR2_PID69_Pos)) /* Assigment of value for PID69 in the AIC_IPR2 register */
#define AIC_IPR2_PID70_Pos                    _UINT32_(6)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID70_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID70_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID70(value)                 (AIC_IPR2_PID70_Msk & (_UINT32_(value) << AIC_IPR2_PID70_Pos)) /* Assigment of value for PID70 in the AIC_IPR2 register */
#define AIC_IPR2_PID71_Pos                    _UINT32_(7)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID71_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID71_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID71(value)                 (AIC_IPR2_PID71_Msk & (_UINT32_(value) << AIC_IPR2_PID71_Pos)) /* Assigment of value for PID71 in the AIC_IPR2 register */
#define AIC_IPR2_PID72_Pos                    _UINT32_(8)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID72_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID72_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID72(value)                 (AIC_IPR2_PID72_Msk & (_UINT32_(value) << AIC_IPR2_PID72_Pos)) /* Assigment of value for PID72 in the AIC_IPR2 register */
#define AIC_IPR2_PID73_Pos                    _UINT32_(9)                                          /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID73_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID73_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID73(value)                 (AIC_IPR2_PID73_Msk & (_UINT32_(value) << AIC_IPR2_PID73_Pos)) /* Assigment of value for PID73 in the AIC_IPR2 register */
#define AIC_IPR2_SYS_Pos                      _UINT32_(10)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_SYS_Msk                      (_UINT32_(0x1) << AIC_IPR2_SYS_Pos)                  /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_SYS(value)                   (AIC_IPR2_SYS_Msk & (_UINT32_(value) << AIC_IPR2_SYS_Pos)) /* Assigment of value for SYS in the AIC_IPR2 register */
#define AIC_IPR2_PID75_Pos                    _UINT32_(11)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID75_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID75_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID75(value)                 (AIC_IPR2_PID75_Msk & (_UINT32_(value) << AIC_IPR2_PID75_Pos)) /* Assigment of value for PID75 in the AIC_IPR2 register */
#define AIC_IPR2_PID76_Pos                    _UINT32_(12)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID76_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID76_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID76(value)                 (AIC_IPR2_PID76_Msk & (_UINT32_(value) << AIC_IPR2_PID76_Pos)) /* Assigment of value for PID76 in the AIC_IPR2 register */
#define AIC_IPR2_PID77_Pos                    _UINT32_(13)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID77_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID77_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID77(value)                 (AIC_IPR2_PID77_Msk & (_UINT32_(value) << AIC_IPR2_PID77_Pos)) /* Assigment of value for PID77 in the AIC_IPR2 register */
#define AIC_IPR2_PID78_Pos                    _UINT32_(14)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID78_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID78_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID78(value)                 (AIC_IPR2_PID78_Msk & (_UINT32_(value) << AIC_IPR2_PID78_Pos)) /* Assigment of value for PID78 in the AIC_IPR2 register */
#define AIC_IPR2_PID79_Pos                    _UINT32_(15)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID79_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID79_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID79(value)                 (AIC_IPR2_PID79_Msk & (_UINT32_(value) << AIC_IPR2_PID79_Pos)) /* Assigment of value for PID79 in the AIC_IPR2 register */
#define AIC_IPR2_PID80_Pos                    _UINT32_(16)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID80_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID80_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID80(value)                 (AIC_IPR2_PID80_Msk & (_UINT32_(value) << AIC_IPR2_PID80_Pos)) /* Assigment of value for PID80 in the AIC_IPR2 register */
#define AIC_IPR2_PID81_Pos                    _UINT32_(17)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID81_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID81_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID81(value)                 (AIC_IPR2_PID81_Msk & (_UINT32_(value) << AIC_IPR2_PID81_Pos)) /* Assigment of value for PID81 in the AIC_IPR2 register */
#define AIC_IPR2_PID82_Pos                    _UINT32_(18)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID82_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID82_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID82(value)                 (AIC_IPR2_PID82_Msk & (_UINT32_(value) << AIC_IPR2_PID82_Pos)) /* Assigment of value for PID82 in the AIC_IPR2 register */
#define AIC_IPR2_PID83_Pos                    _UINT32_(19)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID83_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID83_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID83(value)                 (AIC_IPR2_PID83_Msk & (_UINT32_(value) << AIC_IPR2_PID83_Pos)) /* Assigment of value for PID83 in the AIC_IPR2 register */
#define AIC_IPR2_PID84_Pos                    _UINT32_(20)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID84_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID84_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID84(value)                 (AIC_IPR2_PID84_Msk & (_UINT32_(value) << AIC_IPR2_PID84_Pos)) /* Assigment of value for PID84 in the AIC_IPR2 register */
#define AIC_IPR2_PID85_Pos                    _UINT32_(21)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID85_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID85_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID85(value)                 (AIC_IPR2_PID85_Msk & (_UINT32_(value) << AIC_IPR2_PID85_Pos)) /* Assigment of value for PID85 in the AIC_IPR2 register */
#define AIC_IPR2_PID86_Pos                    _UINT32_(22)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID86_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID86_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID86(value)                 (AIC_IPR2_PID86_Msk & (_UINT32_(value) << AIC_IPR2_PID86_Pos)) /* Assigment of value for PID86 in the AIC_IPR2 register */
#define AIC_IPR2_PID87_Pos                    _UINT32_(23)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID87_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID87_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID87(value)                 (AIC_IPR2_PID87_Msk & (_UINT32_(value) << AIC_IPR2_PID87_Pos)) /* Assigment of value for PID87 in the AIC_IPR2 register */
#define AIC_IPR2_PID88_Pos                    _UINT32_(24)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID88_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID88_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID88(value)                 (AIC_IPR2_PID88_Msk & (_UINT32_(value) << AIC_IPR2_PID88_Pos)) /* Assigment of value for PID88 in the AIC_IPR2 register */
#define AIC_IPR2_PID89_Pos                    _UINT32_(25)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID89_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID89_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID89(value)                 (AIC_IPR2_PID89_Msk & (_UINT32_(value) << AIC_IPR2_PID89_Pos)) /* Assigment of value for PID89 in the AIC_IPR2 register */
#define AIC_IPR2_PID90_Pos                    _UINT32_(26)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID90_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID90_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID90(value)                 (AIC_IPR2_PID90_Msk & (_UINT32_(value) << AIC_IPR2_PID90_Pos)) /* Assigment of value for PID90 in the AIC_IPR2 register */
#define AIC_IPR2_PID91_Pos                    _UINT32_(27)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID91_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID91_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID91(value)                 (AIC_IPR2_PID91_Msk & (_UINT32_(value) << AIC_IPR2_PID91_Pos)) /* Assigment of value for PID91 in the AIC_IPR2 register */
#define AIC_IPR2_PID92_Pos                    _UINT32_(28)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID92_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID92_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID92(value)                 (AIC_IPR2_PID92_Msk & (_UINT32_(value) << AIC_IPR2_PID92_Pos)) /* Assigment of value for PID92 in the AIC_IPR2 register */
#define AIC_IPR2_PID93_Pos                    _UINT32_(29)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID93_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID93_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID93(value)                 (AIC_IPR2_PID93_Msk & (_UINT32_(value) << AIC_IPR2_PID93_Pos)) /* Assigment of value for PID93 in the AIC_IPR2 register */
#define AIC_IPR2_PID94_Pos                    _UINT32_(30)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID94_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID94_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID94(value)                 (AIC_IPR2_PID94_Msk & (_UINT32_(value) << AIC_IPR2_PID94_Pos)) /* Assigment of value for PID94 in the AIC_IPR2 register */
#define AIC_IPR2_PID95_Pos                    _UINT32_(31)                                         /* (AIC_IPR2) Interrupt Pending Position */
#define AIC_IPR2_PID95_Msk                    (_UINT32_(0x1) << AIC_IPR2_PID95_Pos)                /* (AIC_IPR2) Interrupt Pending Mask */
#define AIC_IPR2_PID95(value)                 (AIC_IPR2_PID95_Msk & (_UINT32_(value) << AIC_IPR2_PID95_Pos)) /* Assigment of value for PID95 in the AIC_IPR2 register */
#define AIC_IPR2_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AIC_IPR2) Register Mask  */


