Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
/* -------- AIC_IPR3 : (AIC Offset: 0x2C) ( R/ 32) Interrupt Pending Register 3 -------- */
#define AIC_IPR3_PID96_Pos                    _UINT32_(0)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID96_Msk                    (_UINT32_(0x1) << AIC_IPR3_PID96_Pos)                /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID96(value)                 (AIC_IPR3_PID96_Msk & (_UINT32_(value) << AIC_IPR3_PID96_Pos)) /* Assigment of value for PID96 in the AIC_IPR3 register */
#define AIC_IPR3_PID97_Pos                    _UINT32_(1)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID97_Msk                    (_UINT32_(0x1) << AIC_IPR3_PID97_Pos)                /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID97(value)                 (AIC_IPR3_PID97_Msk & (_UINT32_(value) << AIC_IPR3_PID97_Pos)) /* Assigment of value for PID97 in the AIC_IPR3 register */
#define AIC_IPR3_PID98_Pos                    _UINT32_(2)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID98_Msk                    (_UINT32_(0x1) << AIC_IPR3_PID98_Pos)                /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID98(value)                 (AIC_IPR3_PID98_Msk & (_UINT32_(value) << AIC_IPR3_PID98_Pos)) /* Assigment of value for PID98 in the AIC_IPR3 register */
#define AIC_IPR3_PID99_Pos                    _UINT32_(3)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID99_Msk                    (_UINT32_(0x1) << AIC_IPR3_PID99_Pos)                /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID99(value)                 (AIC_IPR3_PID99_Msk & (_UINT32_(value) << AIC_IPR3_PID99_Pos)) /* Assigment of value for PID99 in the AIC_IPR3 register */
#define AIC_IPR3_PID100_Pos                   _UINT32_(4)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID100_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID100_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID100(value)                (AIC_IPR3_PID100_Msk & (_UINT32_(value) << AIC_IPR3_PID100_Pos)) /* Assigment of value for PID100 in the AIC_IPR3 register */
#define AIC_IPR3_PID101_Pos                   _UINT32_(5)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID101_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID101_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID101(value)                (AIC_IPR3_PID101_Msk & (_UINT32_(value) << AIC_IPR3_PID101_Pos)) /* Assigment of value for PID101 in the AIC_IPR3 register */
#define AIC_IPR3_PID102_Pos                   _UINT32_(6)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID102_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID102_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID102(value)                (AIC_IPR3_PID102_Msk & (_UINT32_(value) << AIC_IPR3_PID102_Pos)) /* Assigment of value for PID102 in the AIC_IPR3 register */
#define AIC_IPR3_PID103_Pos                   _UINT32_(7)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID103_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID103_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID103(value)                (AIC_IPR3_PID103_Msk & (_UINT32_(value) << AIC_IPR3_PID103_Pos)) /* Assigment of value for PID103 in the AIC_IPR3 register */
#define AIC_IPR3_PID104_Pos                   _UINT32_(8)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID104_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID104_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID104(value)                (AIC_IPR3_PID104_Msk & (_UINT32_(value) << AIC_IPR3_PID104_Pos)) /* Assigment of value for PID104 in the AIC_IPR3 register */
#define AIC_IPR3_PID105_Pos                   _UINT32_(9)                                          /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID105_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID105_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID105(value)                (AIC_IPR3_PID105_Msk & (_UINT32_(value) << AIC_IPR3_PID105_Pos)) /* Assigment of value for PID105 in the AIC_IPR3 register */
#define AIC_IPR3_PID106_Pos                   _UINT32_(10)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID106_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID106_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID106(value)                (AIC_IPR3_PID106_Msk & (_UINT32_(value) << AIC_IPR3_PID106_Pos)) /* Assigment of value for PID106 in the AIC_IPR3 register */
#define AIC_IPR3_PID107_Pos                   _UINT32_(11)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID107_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID107_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID107(value)                (AIC_IPR3_PID107_Msk & (_UINT32_(value) << AIC_IPR3_PID107_Pos)) /* Assigment of value for PID107 in the AIC_IPR3 register */
#define AIC_IPR3_PID108_Pos                   _UINT32_(12)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID108_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID108_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID108(value)                (AIC_IPR3_PID108_Msk & (_UINT32_(value) << AIC_IPR3_PID108_Pos)) /* Assigment of value for PID108 in the AIC_IPR3 register */
#define AIC_IPR3_PID109_Pos                   _UINT32_(13)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID109_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID109_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID109(value)                (AIC_IPR3_PID109_Msk & (_UINT32_(value) << AIC_IPR3_PID109_Pos)) /* Assigment of value for PID109 in the AIC_IPR3 register */
#define AIC_IPR3_PID110_Pos                   _UINT32_(14)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID110_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID110_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID110(value)                (AIC_IPR3_PID110_Msk & (_UINT32_(value) << AIC_IPR3_PID110_Pos)) /* Assigment of value for PID110 in the AIC_IPR3 register */
#define AIC_IPR3_PID111_Pos                   _UINT32_(15)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID111_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID111_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID111(value)                (AIC_IPR3_PID111_Msk & (_UINT32_(value) << AIC_IPR3_PID111_Pos)) /* Assigment of value for PID111 in the AIC_IPR3 register */
#define AIC_IPR3_PID112_Pos                   _UINT32_(16)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID112_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID112_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID112(value)                (AIC_IPR3_PID112_Msk & (_UINT32_(value) << AIC_IPR3_PID112_Pos)) /* Assigment of value for PID112 in the AIC_IPR3 register */
#define AIC_IPR3_PID113_Pos                   _UINT32_(17)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID113_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID113_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID113(value)                (AIC_IPR3_PID113_Msk & (_UINT32_(value) << AIC_IPR3_PID113_Pos)) /* Assigment of value for PID113 in the AIC_IPR3 register */
#define AIC_IPR3_PID114_Pos                   _UINT32_(18)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID114_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID114_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID114(value)                (AIC_IPR3_PID114_Msk & (_UINT32_(value) << AIC_IPR3_PID114_Pos)) /* Assigment of value for PID114 in the AIC_IPR3 register */
#define AIC_IPR3_PID115_Pos                   _UINT32_(19)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID115_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID115_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID115(value)                (AIC_IPR3_PID115_Msk & (_UINT32_(value) << AIC_IPR3_PID115_Pos)) /* Assigment of value for PID115 in the AIC_IPR3 register */
#define AIC_IPR3_PID116_Pos                   _UINT32_(20)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID116_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID116_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID116(value)                (AIC_IPR3_PID116_Msk & (_UINT32_(value) << AIC_IPR3_PID116_Pos)) /* Assigment of value for PID116 in the AIC_IPR3 register */
#define AIC_IPR3_PID117_Pos                   _UINT32_(21)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID117_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID117_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID117(value)                (AIC_IPR3_PID117_Msk & (_UINT32_(value) << AIC_IPR3_PID117_Pos)) /* Assigment of value for PID117 in the AIC_IPR3 register */
#define AIC_IPR3_PID118_Pos                   _UINT32_(22)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID118_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID118_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID118(value)                (AIC_IPR3_PID118_Msk & (_UINT32_(value) << AIC_IPR3_PID118_Pos)) /* Assigment of value for PID118 in the AIC_IPR3 register */
#define AIC_IPR3_PID119_Pos                   _UINT32_(23)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID119_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID119_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID119(value)                (AIC_IPR3_PID119_Msk & (_UINT32_(value) << AIC_IPR3_PID119_Pos)) /* Assigment of value for PID119 in the AIC_IPR3 register */
#define AIC_IPR3_PID120_Pos                   _UINT32_(24)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID120_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID120_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID120(value)                (AIC_IPR3_PID120_Msk & (_UINT32_(value) << AIC_IPR3_PID120_Pos)) /* Assigment of value for PID120 in the AIC_IPR3 register */
#define AIC_IPR3_PID121_Pos                   _UINT32_(25)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID121_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID121_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID121(value)                (AIC_IPR3_PID121_Msk & (_UINT32_(value) << AIC_IPR3_PID121_Pos)) /* Assigment of value for PID121 in the AIC_IPR3 register */
#define AIC_IPR3_PID122_Pos                   _UINT32_(26)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID122_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID122_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID122(value)                (AIC_IPR3_PID122_Msk & (_UINT32_(value) << AIC_IPR3_PID122_Pos)) /* Assigment of value for PID122 in the AIC_IPR3 register */
#define AIC_IPR3_PID123_Pos                   _UINT32_(27)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID123_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID123_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID123(value)                (AIC_IPR3_PID123_Msk & (_UINT32_(value) << AIC_IPR3_PID123_Pos)) /* Assigment of value for PID123 in the AIC_IPR3 register */
#define AIC_IPR3_PID124_Pos                   _UINT32_(28)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID124_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID124_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID124(value)                (AIC_IPR3_PID124_Msk & (_UINT32_(value) << AIC_IPR3_PID124_Pos)) /* Assigment of value for PID124 in the AIC_IPR3 register */
#define AIC_IPR3_PID125_Pos                   _UINT32_(29)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID125_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID125_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID125(value)                (AIC_IPR3_PID125_Msk & (_UINT32_(value) << AIC_IPR3_PID125_Pos)) /* Assigment of value for PID125 in the AIC_IPR3 register */
#define AIC_IPR3_PID126_Pos                   _UINT32_(30)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID126_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID126_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID126(value)                (AIC_IPR3_PID126_Msk & (_UINT32_(value) << AIC_IPR3_PID126_Pos)) /* Assigment of value for PID126 in the AIC_IPR3 register */
#define AIC_IPR3_PID127_Pos                   _UINT32_(31)                                         /* (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID127_Msk                   (_UINT32_(0x1) << AIC_IPR3_PID127_Pos)               /* (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID127(value)                (AIC_IPR3_PID127_Msk & (_UINT32_(value) << AIC_IPR3_PID127_Pos)) /* Assigment of value for PID127 in the AIC_IPR3 register */
#define AIC_IPR3_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AIC_IPR3) Register Mask  */

#define AIC_IPR3_PID_Pos                      _UINT32_(0)                                          /* (AIC_IPR3 Position) Interrupt Pending */
#define AIC_IPR3_PID_Msk                      (_UINT32_(0xFFFFFFFF) << AIC_IPR3_PID_Pos)           /* (AIC_IPR3 Mask) PID */
#define AIC_IPR3_PID(value)                   (AIC_IPR3_PID_Msk & (_UINT32_(value) << AIC_IPR3_PID_Pos)) 

/* -------- AIC_IMR : (AIC Offset: 0x30) ( R/ 32) Interrupt Mask Register -------- */
#define AIC_IMR_INTM_Pos                      _UINT32_(0)                                          /* (AIC_IMR) Interrupt Mask Position */
#define AIC_IMR_INTM_Msk                      (_UINT32_(0x1) << AIC_IMR_INTM_Pos)                  /* (AIC_IMR) Interrupt Mask Mask */
#define AIC_IMR_INTM(value)                   (AIC_IMR_INTM_Msk & (_UINT32_(value) << AIC_IMR_INTM_Pos)) /* Assigment of value for INTM in the AIC_IMR register */
#define AIC_IMR_Msk                           _UINT32_(0x00000001)                                 /* (AIC_IMR) Register Mask  */


/* -------- AIC_CISR : (AIC Offset: 0x34) ( R/ 32) Core Interrupt Status Register -------- */
#define AIC_CISR_NFIQ_Pos                     _UINT32_(0)                                          /* (AIC_CISR) NFIQ Status Position */
#define AIC_CISR_NFIQ_Msk                     (_UINT32_(0x1) << AIC_CISR_NFIQ_Pos)                 /* (AIC_CISR) NFIQ Status Mask */
#define AIC_CISR_NFIQ(value)                  (AIC_CISR_NFIQ_Msk & (_UINT32_(value) << AIC_CISR_NFIQ_Pos)) /* Assigment of value for NFIQ in the AIC_CISR register */
#define AIC_CISR_NIRQ_Pos                     _UINT32_(1)                                          /* (AIC_CISR) NIRQ Status Position */
#define AIC_CISR_NIRQ_Msk                     (_UINT32_(0x1) << AIC_CISR_NIRQ_Pos)                 /* (AIC_CISR) NIRQ Status Mask */
#define AIC_CISR_NIRQ(value)                  (AIC_CISR_NIRQ_Msk & (_UINT32_(value) << AIC_CISR_NIRQ_Pos)) /* Assigment of value for NIRQ in the AIC_CISR register */
#define AIC_CISR_Msk                          _UINT32_(0x00000003)                                 /* (AIC_CISR) Register Mask  */


