Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/aic.h
/* -------- AIC_EOICR : (AIC Offset: 0x38) ( /W 32) End of Interrupt Command Register -------- */
#define AIC_EOICR_ENDIT_Pos                   _UINT32_(0)                                          /* (AIC_EOICR) Interrupt Processing Complete Command Position */
#define AIC_EOICR_ENDIT_Msk                   (_UINT32_(0x1) << AIC_EOICR_ENDIT_Pos)               /* (AIC_EOICR) Interrupt Processing Complete Command Mask */
#define AIC_EOICR_ENDIT(value)                (AIC_EOICR_ENDIT_Msk & (_UINT32_(value) << AIC_EOICR_ENDIT_Pos)) /* Assigment of value for ENDIT in the AIC_EOICR register */
#define AIC_EOICR_Msk                         _UINT32_(0x00000001)                                 /* (AIC_EOICR) Register Mask  */


/* -------- AIC_SPU : (AIC Offset: 0x3C) (R/W 32) Spurious Interrupt Vector Register -------- */
#define AIC_SPU_SIVR_Pos                      _UINT32_(0)                                          /* (AIC_SPU) Spurious Interrupt Vector Register Position */
#define AIC_SPU_SIVR_Msk                      (_UINT32_(0xFFFFFFFF) << AIC_SPU_SIVR_Pos)           /* (AIC_SPU) Spurious Interrupt Vector Register Mask */
#define AIC_SPU_SIVR(value)                   (AIC_SPU_SIVR_Msk & (_UINT32_(value) << AIC_SPU_SIVR_Pos)) /* Assigment of value for SIVR in the AIC_SPU register */
#define AIC_SPU_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AIC_SPU) Register Mask  */


/* -------- AIC_IECR : (AIC Offset: 0x40) ( /W 32) Interrupt Enable Command Register -------- */
#define AIC_IECR_INTEN_Pos                    _UINT32_(0)                                          /* (AIC_IECR) Interrupt Enable Position */
#define AIC_IECR_INTEN_Msk                    (_UINT32_(0x1) << AIC_IECR_INTEN_Pos)                /* (AIC_IECR) Interrupt Enable Mask */
#define AIC_IECR_INTEN(value)                 (AIC_IECR_INTEN_Msk & (_UINT32_(value) << AIC_IECR_INTEN_Pos)) /* Assigment of value for INTEN in the AIC_IECR register */
#define AIC_IECR_Msk                          _UINT32_(0x00000001)                                 /* (AIC_IECR) Register Mask  */


/* -------- AIC_IDCR : (AIC Offset: 0x44) ( /W 32) Interrupt Disable Command Register -------- */
#define AIC_IDCR_INTD_Pos                     _UINT32_(0)                                          /* (AIC_IDCR) Interrupt Disable Position */
#define AIC_IDCR_INTD_Msk                     (_UINT32_(0x1) << AIC_IDCR_INTD_Pos)                 /* (AIC_IDCR) Interrupt Disable Mask */
#define AIC_IDCR_INTD(value)                  (AIC_IDCR_INTD_Msk & (_UINT32_(value) << AIC_IDCR_INTD_Pos)) /* Assigment of value for INTD in the AIC_IDCR register */
#define AIC_IDCR_Msk                          _UINT32_(0x00000001)                                 /* (AIC_IDCR) Register Mask  */


/* -------- AIC_ICCR : (AIC Offset: 0x48) ( /W 32) Interrupt Clear Command Register -------- */
#define AIC_ICCR_INTCLR_Pos                   _UINT32_(0)                                          /* (AIC_ICCR) Interrupt Clear Position */
#define AIC_ICCR_INTCLR_Msk                   (_UINT32_(0x1) << AIC_ICCR_INTCLR_Pos)               /* (AIC_ICCR) Interrupt Clear Mask */
#define AIC_ICCR_INTCLR(value)                (AIC_ICCR_INTCLR_Msk & (_UINT32_(value) << AIC_ICCR_INTCLR_Pos)) /* Assigment of value for INTCLR in the AIC_ICCR register */
#define AIC_ICCR_Msk                          _UINT32_(0x00000001)                                 /* (AIC_ICCR) Register Mask  */


/* -------- AIC_ISCR : (AIC Offset: 0x4C) ( /W 32) Interrupt Set Command Register -------- */
#define AIC_ISCR_INTSET_Pos                   _UINT32_(0)                                          /* (AIC_ISCR) Interrupt Set Position */
#define AIC_ISCR_INTSET_Msk                   (_UINT32_(0x1) << AIC_ISCR_INTSET_Pos)               /* (AIC_ISCR) Interrupt Set Mask */
#define AIC_ISCR_INTSET(value)                (AIC_ISCR_INTSET_Msk & (_UINT32_(value) << AIC_ISCR_INTSET_Pos)) /* Assigment of value for INTSET in the AIC_ISCR register */
#define AIC_ISCR_Msk                          _UINT32_(0x00000001)                                 /* (AIC_ISCR) Register Mask  */


/* -------- AIC_DCR : (AIC Offset: 0x6C) (R/W 32) Debug Control Register -------- */
#define AIC_DCR_PROT_Pos                      _UINT32_(0)                                          /* (AIC_DCR) Protection Mode Position */
#define AIC_DCR_PROT_Msk                      (_UINT32_(0x1) << AIC_DCR_PROT_Pos)                  /* (AIC_DCR) Protection Mode Mask */
#define AIC_DCR_PROT(value)                   (AIC_DCR_PROT_Msk & (_UINT32_(value) << AIC_DCR_PROT_Pos)) /* Assigment of value for PROT in the AIC_DCR register */
#define AIC_DCR_GMSK_Pos                      _UINT32_(1)                                          /* (AIC_DCR) General Interrupt Mask Position */
#define AIC_DCR_GMSK_Msk                      (_UINT32_(0x1) << AIC_DCR_GMSK_Pos)                  /* (AIC_DCR) General Interrupt Mask Mask */
#define AIC_DCR_GMSK(value)                   (AIC_DCR_GMSK_Msk & (_UINT32_(value) << AIC_DCR_GMSK_Pos)) /* Assigment of value for GMSK in the AIC_DCR register */
#define AIC_DCR_Msk                           _UINT32_(0x00000003)                                 /* (AIC_DCR) Register Mask  */


/* -------- AIC_WPMR : (AIC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define AIC_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (AIC_WPMR) Write Protection Enable Position */
#define AIC_WPMR_WPEN_Msk                     (_UINT32_(0x1) << AIC_WPMR_WPEN_Pos)                 /* (AIC_WPMR) Write Protection Enable Mask */
#define AIC_WPMR_WPEN(value)                  (AIC_WPMR_WPEN_Msk & (_UINT32_(value) << AIC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the AIC_WPMR register */
#define AIC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (AIC_WPMR) Write Protection Key Position */
#define AIC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << AIC_WPMR_WPKEY_Pos)           /* (AIC_WPMR) Write Protection Key Mask */
#define AIC_WPMR_WPKEY(value)                 (AIC_WPMR_WPKEY_Msk & (_UINT32_(value) << AIC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the AIC_WPMR register */
#define   AIC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x414943)                                   /* (AIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define AIC_WPMR_WPKEY_PASSWD                 (AIC_WPMR_WPKEY_PASSWD_Val << AIC_WPMR_WPKEY_Pos)    /* (AIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define AIC_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (AIC_WPMR) Register Mask  */


